message-api/app/controllers/api/v1/articles_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."account_id" = $1 LIMIT $2  [["account_id", 6], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" IN (11, 10, 13, 9)
---
  def index
    current_user = User.find_by(account_id: @current_account.id)
    following_ids = current_user.following_ids.push(current_user.id)
    articles = Article.where(user_id: following_ids)

INSERT INTO "articles" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    article = Article.create(article_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 62], ["LIMIT", 1]]
UPDATE "articles" SET "body" = $1, "updated_at" = $2 WHERE "articles"."id" = $3
---
  def update
    article = Article.find(params[:id])
    article.update(article_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 62], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 62]]
---
  def destroy
    article = Article.find(params[:id])
    article.delete