message-api/app/controllers/api/v1/auth_controller.rb

  def create
    account = Account.find_by(username: params[:accountName])
    user = User.find_by(account_id: account.id)
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."username" = $1 LIMIT $2  [["username", "dev"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."account_id" = $1 LIMIT $2  [["account_id", 6], ["LIMIT", 1]]