message-api/app/controllers/api/v1/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def show
    found_user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "profile" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["profile", "Host of Cupcake Wars exciting yes! "], ["updated_at", "2017-06-29 19:45:44.417355"], ["id", 9]]
---
  def update
    user = User.find(params[:id])
    user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."account_id" = $1 LIMIT $2  [["account_id", 6], ["LIMIT", 1]]
---
  def new_follow
    authorize_account!
    to_be_followed = User.find(params[:id])
    current_user = User.find_by(account_id: @current_account.id)